[
  {
    "title": "Toad in the Hole",
    "image": "https://imagesvc.meredithcorp.io/v3/jumpstartpure/image/?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fcd226b47-fc02-4813-82a1-ff74ff05eed8%2F0caf2fae-d06f-4ca9-8311-8a9c8179cd00%2F1280x720%2Fmatch%2Fimage.jpg&w=640&h=360&q=90&c=cc",
    "cookingTime": 40,
    "countryOfOrigin": "England",
    "continent": "Europe",
    "level": "Intermediate",
    "mealType": "Dinner",
    "serves": 4,
    "ingredients": [
      "For the batter:",
      "4 large eggs",
      "1/2 teaspoon kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "2 pinches cayenne pepper",
      "1 cup all-purpose flour",
      "1 tablespoon all-purpose flour",
      "3/4 cup whole milk",
      "1/4 cup cold water",
      "",
      "For the sausages:",
      "1/4 cup vegetable oil",
      "6 pork sausages",
      "",
      "For the onion gravy:",
      "2 tablespoons butter",
      "1 large red onion, minced",
      "kosher salt to taste",
      "3 tablespoons all-purpose flour",
      "2 cups chicken broth",
      "1/4 teaspoon Worcestershire sauce",
      "1 teaspoon balsamic vinegar",
      "2 tablespoons Onions, spring or scallions (includes tops and bulb), raw",
      "1 teaspoon chopped fresh chives, or to taste"
    ],
    "directions": [
      "1. Prepare batter: Combine eggs, salt, pepper, cayenne, 1 cup plus 1 tablespoon flour, and milk in a large bowl; whisk thoroughly until batter is very smooth and no lumps remain. Whisk in water. Cover and let rest at room temperature for 1 hour.",
      "2. Prepare sausages: Heat vegetable oil in a skillet over medium-high heat. Add sausages and cook until browned, 2 to 3 minutes per side. Remove from the heat and transfer to a buttered 9x12- or 9x13-inch baking dish. Pour oil from the skillet over the sausages; brush oil with a pastry brush all over the bottom and up the sides of the dish.",
      "3. Start onion gravy: Melt butter in the same skillet over medium-high heat. Add onion and salt; saute until soft and starting to brown, 5 to 6 minutes.",
      "4. While onion is cooking, pour batter in and around the sausages. Place in the center of a cold oven and turn temperature to 500 degrees F (260 degrees C). Set oven timer for 30 minutes.",
      "5. While toad in the hole cooks, finish onion gravy: Stir in flour and cook for about 2 minutes. Whisk in chicken broth and return to a simmer. Add Worcestershire sauce and balsamic vinegar and simmer until gravy thickens up and reduces, about 5 minutes. Reduce heat to low and stir in green onions. Taste and adjust seasoning.",
      "6. When timer goes off, remove toad in the hole from the oven; it should be browned and puffed. Spoon gravy over the sausages and garnish with green onions and chives.",
      "7. Serve with extra gravy."
    ],
    "recipeType": "Meat",
    "createdBy": []
  },
  {
    "title": "Pad Thai",
    "image": "https://www.allrecipes.com/thmb/26jGU52TKiTkPyWt3H5oZtc_sxE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1023388-5b62f9c37d65451a8951981c07150b41.jpg",
    "cookingTime": 20,
    "countryOfOrigin": "Thailand",
    "continent": "Asia",
    "level": "Intermediate",
    "mealType": "Dinner",
    "serves": 6,
    "ingredients": [
      "12 ounces dried rice noodles",
      "1/2 cup white sugar",
      "1/2 cup distilled white vinegar",
      "1/4 cup fish sauce",
      "2 tablespoons tamarind paste",
      "2 tablespoons vegetable oil, divided",
      "2 boneless, skinless chicken breast halves, sliced into thin strips",
      "1/2 teaspoons garlic, minced",
      "4 large eggs, beaten",
      "1/2 tablespoons white sugar",
      "1/2 teaspoons salt",
      "1 cup coarsely ground peanuts",
      "2 cups bean sprouts",
      "1/2 cup chopped fresh chives",
      "1 tablespoon paprika, or to taste",
      "1 medium lime, cut into wedges"
    ],
    "directions": [
      "1. Place rice noodles into a large bowl and cover with several inches of room temperature water; let soak for 30 to 60 minutes. Drain.",
      "2. Whisk 1/2 cup sugar, vinegar, fish sauce, and tamarind paste together in a saucepan over medium heat. Bring to a simmer, then remove from the heat.",
      "3. Heat 1 tablespoon oil in a skillet over medium-high heat. Add chicken; cook and stir until chicken is no longer pink in the center and the juices run clear, 5 to 7 minutes. Remove from the heat.",
      "4. Heat remaining 1 tablespoon oil in a large skillet or wok over medium-high heat. Add garlic and cook until fragrant, about 1 minute. Stir in eggs; scramble until eggs are nearly cooked through, about 2 minutes. Add chicken and rice noodles and stir until well combined.",
      "5. Stir in tamarind mixture, 1 1/2 tablespoons sugar, and salt; cook until noodles are tender, 3 to 5 minutes. Stir in peanuts and cook until heated through, 1 to 2 minutes. Garnish with bean sprouts, chives, and paprika; serve with lime wedges."
    ],
    "recipeType": "Meat",
    "createdBy": []
  },
  {
    "title": "Khao Soi",
    "image": "https://www.allrecipes.com/thmb/2Vu-Ngrrw9_IMaq8jGlMOYQjIIY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5464675-12d20943411f49008e8e4be404abf47c.jpg",
    "cookingTime": 30,
    "countryOfOrigin": "Thailand",
    "continent": "Asia",
    "level": "Intermediate",
    "mealType": "Dinner",
    "serves": 6,
    "ingredients": [
      "2 tablespoons vegetable oil",
      "3 shallots, chopped",
      "3 cloves garlic, minced",
      "1/4 cup red curry paste",
      "1 tablespoon curry powder",
      "4 cups coconut milk",
      "2 cups water",
      "2 cups chopped cooked chicken, or more to taste",
      "1 teaspoon sea salt",
      "2 tablespoons fish sauce",
      "2 tablespoons white sugar",
      "1 tablespoon lime juice",
      "1/2 cup vegetable oil",
      "12 whole dried Thai chile peppers",
      "6 small shallots, cut into quarters",
      "1/2 head bok choy, chopped",
      "1 (8 ounce) package rice noodles",
      "1 cup pickled mustard cabbage, thinly sliced (Optional)",
      "1/2 cup coarsely chopped fresh cilantro",
      "1 lime, cut into wedges"
    ],
    "directions": [
      "1. Heat 2 tablespoons oil in a wok or large skillet over medium heat; cook and stir chopped shallots and garlic until garlic starts to turn golden, 2 to 4 minutes. Add red curry paste and curry powder; cook and stir until fragrant, 1 to 2 minutes. Add coconut milk, water, chicken, and sea salt; bring to a boil. Reduce heat to medium low and simmer soup.",
      "2. Mix fish sauce, sugar, and lime juice into soup and simmer until heated through, about 10 minutes more.",
      "3. Heat 1/2 cup oil in a skillet over medium-high heat; fry Thai chile peppers until browned, 2 to 4 minutes. Transfer chile peppers to soup, reserving oil in skillet. Fry quartered shallots and bok choy in hot oil until browned, 2 to 4 minutes; transfer to soup and reserve oil in skillet.",
      "4. Place noodles in a large bowl and cover with hot water. Set aside until noodles are softened, about 15 minutes. Drain and rinse thoroughly. Add 3/4 of the noodles to the soup. Fry the remaining rice noodles in the hot oil until crisp, 3 to 5 minutes.",
      "5. Divide soup among 6 bowls and top with fried noodles, pickled cabbage, cilantro, and lime wedges."
    ],
    "recipeType": "Meat",
    "createdBy": []
  },
  {
    "title": "Welsh Rarebit",
    "image": "https://www.easycheesyvegetarian.com/wp-content/uploads/2022/07/perfect-welsh-rarebit-featured-1.jpg",
    "cookingTime": 10,
    "countryOfOrigin": "Wales",
    "continent": "Europe",
    "level": "Novice",
    "mealType": "Breakfast",
    "serves": 8,
    "ingredients": [
      "2 tablespoons butter",
      "1/4 cup all-purpose flour",
      "2 teaspoons Worcestershire sauce",
      "1/2 teaspoon dry mustard",
      "1/2 teaspoon salt",
      "1/2 teaspoon ground black pepper",
      "1 cup British beer (Optional)",
      "1/2 cups heavy cream",
      "4 cups shredded sharp Cheddar cheese",
      "4 large egg yolks",
      "8 slices bread"
    ],
    "directions": [
      "1. Melt butter in a large saucepan over low heat. Add flour and whisk for 2 to 3 minutes, being careful not to brown flour. Whisk in Worcestershire sauce, mustard, salt, and pepper until very smooth. Whisk in beer. Pour in heavy cream and whisk until smooth. Add Cheddar cheese gradually, stirring constantly, until melted and smooth, about 5 minutes.",
      "2. Remove cheese sauce from the heat and let cool, about 5 minutes. Whisk in egg yolks until incorporated.",
      "3. Set the oven rack about 6 inches from the heat source and preheat the oven's broiler.",
      "4. Toast bread slices on 1 side. Arrange on a baking sheet with the untoasted side facing up. Spoon cheese sauce over untoasted side.",
      "5. Place under the preheated broiler until cheese sauce is bubbling and golden, 2 to 3 minutes."
    ],
    "recipeType": "Vegetarian",
    "createdBy": []
  },
  {
    "title": "Chakalaka",
    "image": "https://www.allrecipes.com/thmb/dCxe5ek4xmECbwqjVR4nUNC5GUg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/9257773-63cc01b39c87490c8b87dd24bd89e009.jpg",
    "cookingTime": 20,
    "countryOfOrigin": "South Africa",
    "continent": "Africa",
    "level": "Intermediate",
    "mealType": "Dinner",
    "serves": 4,
    "ingredients": [
      "1 tablespoon oil, or as needed",
      "3 medium onions, diced",
      "2 medium green bell peppers, diced",
      "3 medium carrots, diced",
      "3 medium tomatoes, diced",
      "2 small Thai green chiles, chopped",
      "1/4 cup water",
      "1 cube vegetable bouillon",
      "1 teaspoon curry powder, or to taste",
      "1 teaspoon chili powder",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "1. Heat oil in a skillet over medium heat; stir in onions and bell peppers. Cook and stir until the onion has softened and turned translucent, about 5 minutes.",
      "2. Add carrots, tomatoes, green chiles, water, bouillon cube, curry powder, chili powder, salt, and pepper. Cook until mixture is well combined and thickened, 15 to 20 minutes."
    ],
    "recipeType": "Vegan",
    "createdBy": []
  }
]
